#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетРабочегоВремениФормы.ТабельПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	//Если Объект.Свойство(
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		
	//КонецЕсли	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УчетРабочегоВремениФормы.ТабельПриЧтенииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Отказ = УчетРабочегоВремениКлиентСервер.ПроверитьУникальностьСтрок(ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриИзменении(Элемент)
	
	УчетРабочегоВремениКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Модифицированность);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	УчетРабочегоВремениКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Направление, Модифицированность);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	УчетРабочегоВремениКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетРабочегоВремениКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	УчетРабочегоВремениКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура ПериодРегистрацииПриИзменении()
	УчетРабочегоВремениФормы.ТабельПериодРегистрацииПриИзменении(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПланирование

&НаКлиенте
Процедура ПланированиеПроектПриИзменении(Элемент)
	ПриИзмененииПроектаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеСотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Сред(Элементы.Планирование.ТекущийЭлемент.Имя, СтрДлина("Планирование")+1);
	Если Найти(ИмяКолонки, "Проект1")>0 Тогда
		ТипКолонки = "Проект1";
	ИначеЕсли Найти(ИмяКолонки, "Проект2")>0 Тогда
		ТипКолонки = "Проект2";	
	ИначеЕсли Найти(ИмяКолонки, "Комментарий")>0 Тогда
		ТипКолонки = "Комментарий";	
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекНомерДня = Число(Сред(ИмяКолонки, СтрДлина(ТипКолонки)+2));
	
	ТекСтрока = Элементы.Планирование.ТекущиеДанные;
	ДанныеЯчейки = ТекСтрока[ИмяКолонки];
	
	Для Каждого ВыбранныйДень Из ВыбранноеЗначение Цикл
		ТекСтрока[ТипКолонки+"_"+День(ВыбранныйДень)] = ДанныеЯчейки; 
	КонецЦикла;	
	ПриИзмененииПроектаНаСервере();

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьДоОкончанияПериода(Команда)
	
	ИмяКолонки = Сред(Элементы.Планирование.ТекущийЭлемент.Имя, СтрДлина("Планирование")+1);
	Если Найти(ИмяКолонки, "Проект1")>0 Тогда
		ТипКолонки = "Проект1";
	ИначеЕсли Найти(ИмяКолонки, "Проект2")>0 Тогда
		ТипКолонки = "Проект2";	
	ИначеЕсли Найти(ИмяКолонки, "Комментарий")>0 Тогда
		ТипКолонки = "Комментарий";	
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекНомерДня = Число(Сред(ИмяКолонки, СтрДлина(ТипКолонки)+2));
	
	ПараметрыДаты = Новый Структура;
	ПараметрыДаты.Вставить("НачальноеЗначение"			, Объект.ДатаНачалаПериода+(ТекНомерДня-1)*86400);
	ПараметрыДаты.Вставить("НачалоПериодаОтображения"	, Объект.ДатаНачалаПериода);
	ПараметрыДаты.Вставить("КонецПериодаОтображения"	, Объект.ДатаОкончанияПериода);
	ПараметрыДаты.Вставить("ПоясняющийТекст"			, "Выберите период копирования");
	
	ОткрытьФорму("ОбщаяФорма.ВыборДаты", ПараметрыДаты, Элементы.Планирование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииПроектаНаСервере()
	УчетРабочегоВремениФормы.ПланированиеПроектПриИзменении(ЭтаФорма);
КонецПроцедуры	

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	УчетРабочегоВремениФормы.ПланированиеСотрудникПриИзменении(ЭтаФорма);
КонецПроцедуры	

#КонецОбласти

