
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОценкиРабот.Записывать = Истина;
	Движения.ОценкиРабот.Очистить();
	
	Для Каждого Стр Из Работы Цикл
		
		Движение = Движения.ОценкиРабот.Добавить();
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Работа = Стр.Работа;
		Движение.Оценка = ИтоговаяОценка;
		Движение.ЗамечаниеУстановлено = Стр.ЗамечаниеУстановлено;
		Движение.ЗамечаниеСнято = Стр.ЗамечаниеСнято;
		Движение.Комментарий = Стр.Комментарий;
		
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ИтоговаяОценка = 250;
	КонецЕсли;	
	
КонецПроцедуры

