
Функция ПолучитьОбязательныеРеквизиты() Экспорт 

	РеквизитыДляПроверки = Новый Структура;
	
    РеквизитыТЧ = Новый Структура();       
    РеквизитыТЧ.Вставить("Сотрудник",2);
    РеквизитыДляПроверки.Вставить("Планирование",РеквизитыТЧ);  
    Возврат РеквизитыДляПроверки;             
    
КонецФункции

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	НомерДняНачалаПериода = День(ДатаНачалаПериода);
	НомерДняОкончанияПериода = День(ДатаОкончанияПериода);

	Движения.ПланированиеЗанятости.Записывать = Истина;
	Движения.ПланированиеЗанятости.Очистить();
	
	Движения.КомментарииПланирования.Записывать = Истина;
	Движения.КомментарииПланирования.Очистить();
	
	Для Каждого СтрокаПланирование Из Планирование Цикл
		ОбрабатываемаяДата = ДатаНачалаПериода;
		Для НомерДня = НомерДняНачалаПериода По НомерДняОкончанияПериода Цикл
			ВсегоПроектов = 0;
			Для НомерПроекта = 1 По 2 Цикл
				Если ЗначениеЗаполнено(СтрокаПланирование["Проект" + НомерПроекта + "_" + НомерДня]) Тогда
					ВсегоПроектов = ВсегоПроектов+1;
				КонецЕсли;
			КонецЦикла;	
			
			Для НомерПроекта = 1 По 2 Цикл
				Если ЗначениеЗаполнено(СтрокаПланирование["Проект" + НомерПроекта + "_" + НомерДня]) Тогда
					Движение = Движения.ПланированиеЗанятости.Добавить();
					Движение.Период 			= ОбрабатываемаяДата;
					Движение.Сотрудник 			= СтрокаПланирование.Сотрудник;
					Движение.ПериодРегистрации 	= ОбрабатываемаяДата;
					Движение.Проект				= СтрокаПланирование["Проект" + НомерПроекта + "_" + НомерДня];
					Движение.Смены				= 1/ВсегоПроектов;
				КонецЕсли;
			КонецЦикла;	
			
			Если ЗначениеЗаполнено(СтрокаПланирование["Комментарий_" + НомерДня]) Тогда
				Движение = Движения.КомментарииПланирования.Добавить();
				Движение.Период 			= ОбрабатываемаяДата;
				Движение.Сотрудник 			= СтрокаПланирование.Сотрудник;
				Движение.ПериодРегистрации 	= ОбрабатываемаяДата;
				Движение.Комментарий		= СтрокаПланирование["Комментарий_" + НомерДня];
			КонецЕсли;	

			ОбрабатываемаяДата = ОбрабатываемаяДата+86400;	
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти