// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Оценка
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВедомостьРабот";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость работ'");
	КомандаПечати.Порядок       = 10;
		
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьРабот") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ВедомостьРабот",
			"Ведомость работ",
			ПечатьЗаказНаряда(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ОценкаКачестваРабот.ПФ_MXL_ВедомостьРабот");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЗаказНаряда(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = ПолучитьМакет("ПФ_MXL_ЗаказНаряд");
	Область_Шапка 				= Макет.ПолучитьОбласть("Шапка");
	Область_Пробел 				= Макет.ПолучитьОбласть("Пробел");  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_ЗаказНаряд";
	
	ДанныеЗаказНаряда = ПолучитьМакет("ДанныеЗаказНаряда");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьРабот.Ссылка,
	|	ВедомостьРабот.Номер,
	|	ВедомостьРабот.Дата,
	|	ВедомостьРабот.Проект,
	|	ВедомостьРабот.Бригадир,
	|	ВедомостьРабот.Бригадир.ЭлектронныйАдрес КАК ЭлектронныйАдрес,
	|	ВедомостьРабот.Проект.Ответственный КАК РуководительПроекта
	|ИЗ
	|	Документ.ВедомостьРабот КАК ВедомостьРабот
	|ГДЕ
	|	ВедомостьРабот.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаШапка = Результат.Выбрать();
	СчСтраниц = 0;
	Пока ВыборкаШапка.Следующий() Цикл
		Если СчСтраниц>0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Область_Шапка.Параметры.Заполнить(ВыборкаШапка);
		Область_Шапка.Параметры.Заголовок = "Заказ-наряд "+ВыборкаШапка.Номер+" от "+Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(Область_Шапка);
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;		
		
		//Выводим данные заказ-наряда
		Настройки = ДанныеЗаказНаряда.НастройкиПоУмолчанию;  
		РасширениеПечати.УстановитьПараметр(Настройки, "Ссылка", ВыборкаШапка.Ссылка);
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		РасширениеПечати.ВывестиСКДВТабличныйДокумент(ДанныеЗаказНаряда, ТабличныйДокумент, КомпоновщикНастроек);
				
		СчСтраниц = СчСтраниц+1;
	КонецЦикла;	
	 
	Возврат ТабличныйДокумент;
	
КонецФункции



